openfoam13/FoamPilotCases/propellerFoundation13/Allmesh
#!/usr/bin/env bash
set -eu
cd "${0%/*}" || exit 1
exec ./Allmesh.FoamPilot "$@"
